[
  {
    "workplace": "County of Santa Clara",
    "position": "Web Content Specialist",
    "description": "As a versatile IT and UX professional, I bring hands-on experience delivering both technical support and user-centered design solutions. Provided Tier 2 support through desk-side, phone, and email channels—resolving hardware and software issues, deploying and configuring devices, and documenting technical solutions. Collaborated across teams to ensure smooth IT operations and end-user satisfaction. Simultaneously contributed to creating intuitive, accessible, and visually engaging digital experiences. Supported user research, prototyping, wireframing, and usability testing for web and mobile platforms. Ability to translate business requirements into effective user journeys and interface designs has helped bridge the gap between technical functionality and user experience. With a strong foundation in troubleshooting, customer interaction, and iterative design, thrive in environments where cross-functional collaboration and continuous improvement are key.",
    "year": "2024 - 2025"
  },

  {
    "workplace": "County of Santa Clara",
    "position": "Application Support Specialist",
    "description": "As an Application Support Specialist, I served as a vital link between business units and technical teams, aligning operational needs with IT solutions. I led stakeholder interviews, created detailed business process documentation, and translated complex requirements into actionable user stories, workflows, and system enhancements. Using tools like Visio, use case diagrams, and value stream mapping, I contributed to strategic planning and the development of business cases that improved performance and reduced costs. On the development side, I supported the full software development lifecycle—designing, coding, testing, and deploying application solutions based on defined business needs. I collaborated closely with analysts to transform requirements into scalable application features, provided maintenance and support for production systems, and ensured quality assurance through unit testing and documentation. My work involved routine yet impactful contributions to core applications, always with a focus on user experience, performance, and reliability.",
    "year": "2023 - 2024"
  },
  {
    "workplace": "County of Santa Clara",
    "position": "IT Support Desk Specialist",
    "description": "I supported mission-critical government operations through a combination of hands-on technical maintenance and strategic hardware lifecycle management. In election operations, I maintained and repaired mechanical and electronic machines, conducted functional testing, and ensured readiness and accuracy in compliance with strict regulatory standards. I participated in the setup, logistics, and delivery of equipment and materials, working in fast-paced, high-volume environments that required coordination, precision, and safety awareness. I also oversaw the full lifecycle of IT hardware, including procurement, inventory tracking, reconciliation, and end-of-life refresh planning. I analyzed usage data and financial trends to optimize inventory control, prevent shrinkage, and support department-level forecasting and budgeting. I contributed to operations and policy enforcement, reviewed vendor contracts, and collaborated across teams to align hardware standards with organizational needs. My work blended technical, operational, and analytical responsibilities in support of secure, efficient, and cost-effective public service delivery.",
    "year": "2020 - 2022"
  },
  {
    "workplace": "CodeRev",
    "position": "Coding Instructor",
    "description": "At CodeRev, I served as a Coding Instructor, teaching a wide range of computer science and engineering concepts to students of various age groups and skill levels. I delivered hands-on lessons in web development using HTML, CSS, and JavaScript, guiding students through the creation of dynamic, interactive websites. Beyond web technologies, I introduced students to physical computing by teaching programming with Arduino, incorporating robotics, sensors, and LED circuits on breadboards to bring code to life. I also led Minecraft modding classes using Java, where I taught object-oriented programming concepts such as classes, methods, inheritance, and conditional control structures. My approach emphasized creativity, problem-solving, and project-based learning to ensure students developed a strong foundational understanding while having fun. My role required the ability to simplify complex topics, adapt to diverse learning styles, and inspire the next generation of coders and engineers.",
    "year": "2018 - 2019"
  },
  {
    "workplace": "De Anza Community College",
    "position": "Instructional Technology Systems Engineer",
    "description": "Experienced in full-stack systems design, implementation, and user support, with a strong focus on integrating digital and computer technologies across instructional and enterprise environments. Led the development and deployment of scalable technology solutions by coordinating system architecture, hardware/software configurations, and cross-platform integration.Demonstrated ability to collaborate with faculty, administrators, and technical teams to define requirements and support critical infrastructure. Skilled in developing and delivering technical training programs, creating user-centered documentation, and performing advanced troubleshooting. Adept at translating complex technical systems into practical workflows while maintaining clear, organized project documentation. Combines technical engineering knowledge with instructional technology expertise to deliver robust backend systems and seamless user-facing experiences.",
    "year": "2016 - 2017"
  }
]
